program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.12.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp16, [1, 128, 96]> melspectrogram) {
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 128, 96]> input_1_cast_fp16 = expand_dims(axes = input_1_axes_0, x = melspectrogram)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 1, 3, 3]> Conv_1_weight_to_fp16 = const()[name = tensor<string, []>("Conv_1_weight_to_fp16"), val = tensor<fp16, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> Conv_1_bias_to_fp16 = const()[name = tensor<string, []>("Conv_1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(704)))];
            tensor<fp16, [1, 32, 64, 48]> input_3_cast_fp16 = conv(bias = Conv_1_bias_to_fp16, dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = Conv_1_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [1, 32, 64, 48]> input_5_cast_fp16 = silu(x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [2]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [32, 1, 3, 3]> Conv_4_weight_to_fp16 = const()[name = tensor<string, []>("Conv_4_weight_to_fp16"), val = tensor<fp16, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(832)))];
            tensor<fp16, [32]> Conv_4_bias_to_fp16 = const()[name = tensor<string, []>("Conv_4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1472)))];
            tensor<fp16, [1, 32, 64, 48]> input_7_cast_fp16 = conv(bias = Conv_4_bias_to_fp16, dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = Conv_4_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [1, 32, 64, 48]> input_tensor_1_cast_fp16 = silu(x = input_7_cast_fp16)[name = tensor<string, []>("input_tensor_1_cast_fp16")];
            tensor<int32, [2]> input_9_axes_0 = const()[name = tensor<string, []>("input_9_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> input_9_keep_dims_0 = const()[name = tensor<string, []>("input_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1]> input_9_cast_fp16 = reduce_mean(axes = input_9_axes_0, keep_dims = input_9_keep_dims_0, x = input_tensor_1_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_11_strides_0 = const()[name = tensor<string, []>("input_11_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_11_dilations_0 = const()[name = tensor<string, []>("input_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_11_groups_0 = const()[name = tensor<string, []>("input_11_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [8, 32, 1, 1]> Conv_8_weight_to_fp16 = const()[name = tensor<string, []>("Conv_8_weight_to_fp16"), val = tensor<fp16, [8, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1600)))];
            tensor<fp16, [8]> Conv_8_bias_to_fp16 = const()[name = tensor<string, []>("Conv_8_bias_to_fp16"), val = tensor<fp16, [8]>([0x1.494p-3, 0x1.c7p-2, 0x1.9b8p-3, -0x1.bd4p-6, -0x1.ad8p-4, -0x1.344p-2, 0x1.394p-2, 0x1.e4p-2])];
            tensor<fp16, [1, 8, 1, 1]> input_11_cast_fp16 = conv(bias = Conv_8_bias_to_fp16, dilations = input_11_dilations_0, groups = input_11_groups_0, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = input_11_strides_0, weight = Conv_8_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> input_13_cast_fp16 = silu(x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_15_strides_0 = const()[name = tensor<string, []>("input_15_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_15_dilations_0 = const()[name = tensor<string, []>("input_15_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_15_groups_0 = const()[name = tensor<string, []>("input_15_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 8, 1, 1]> Conv_11_weight_to_fp16 = const()[name = tensor<string, []>("Conv_11_weight_to_fp16"), val = tensor<fp16, [32, 8, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2176)))];
            tensor<fp16, [32]> Conv_11_bias_to_fp16 = const()[name = tensor<string, []>("Conv_11_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2752)))];
            tensor<fp16, [1, 32, 1, 1]> input_15_cast_fp16 = conv(bias = Conv_11_bias_to_fp16, dilations = input_15_dilations_0, groups = input_15_groups_0, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = input_15_strides_0, weight = Conv_11_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [1, 32, 1, 1]> first_1_cast_fp16 = sigmoid(x = input_15_cast_fp16)[name = tensor<string, []>("first_1_cast_fp16")];
            tensor<fp16, [1, 32, 64, 48]> input_17_cast_fp16 = mul(x = first_1_cast_fp16, y = input_tensor_1_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_19_strides_0 = const()[name = tensor<string, []>("input_19_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_19_dilations_0 = const()[name = tensor<string, []>("input_19_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_19_groups_0 = const()[name = tensor<string, []>("input_19_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 32, 1, 1]> Conv_14_weight_to_fp16 = const()[name = tensor<string, []>("Conv_14_weight_to_fp16"), val = tensor<fp16, [16, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2880)))];
            tensor<fp16, [16]> Conv_14_bias_to_fp16 = const()[name = tensor<string, []>("Conv_14_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3968)))];
            tensor<fp16, [1, 16, 64, 48]> input_19_cast_fp16 = conv(bias = Conv_14_bias_to_fp16, dilations = input_19_dilations_0, groups = input_19_groups_0, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = input_19_strides_0, weight = Conv_14_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [96, 16, 1, 1]> Conv_15_weight_to_fp16 = const()[name = tensor<string, []>("Conv_15_weight_to_fp16"), val = tensor<fp16, [96, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4096)))];
            tensor<fp16, [96]> Conv_15_bias_to_fp16 = const()[name = tensor<string, []>("Conv_15_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7232)))];
            tensor<fp16, [1, 96, 64, 48]> input_21_cast_fp16 = conv(bias = Conv_15_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = Conv_15_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 96, 64, 48]> input_23_cast_fp16 = silu(x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(96)];
            tensor<int32, [2]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [96, 1, 3, 3]> Conv_18_weight_to_fp16 = const()[name = tensor<string, []>("Conv_18_weight_to_fp16"), val = tensor<fp16, [96, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7488)))];
            tensor<fp16, [96]> Conv_18_bias_to_fp16 = const()[name = tensor<string, []>("Conv_18_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9280)))];
            tensor<fp16, [1, 96, 32, 24]> input_25_cast_fp16 = conv(bias = Conv_18_bias_to_fp16, dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = Conv_18_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 96, 32, 24]> input_tensor_3_cast_fp16 = silu(x = input_25_cast_fp16)[name = tensor<string, []>("input_tensor_3_cast_fp16")];
            tensor<int32, [2]> input_27_axes_0 = const()[name = tensor<string, []>("input_27_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> input_27_keep_dims_0 = const()[name = tensor<string, []>("input_27_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 96, 1, 1]> input_27_cast_fp16 = reduce_mean(axes = input_27_axes_0, keep_dims = input_27_keep_dims_0, x = input_tensor_3_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [4, 96, 1, 1]> Conv_22_weight_to_fp16 = const()[name = tensor<string, []>("Conv_22_weight_to_fp16"), val = tensor<fp16, [4, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9536)))];
            tensor<fp16, [4]> Conv_22_bias_to_fp16 = const()[name = tensor<string, []>("Conv_22_bias_to_fp16"), val = tensor<fp16, [4]>([0x1.4b8p-4, 0x1.a24p-3, -0x1.15p-4, 0x1.50cp-3])];
            tensor<fp16, [1, 4, 1, 1]> input_29_cast_fp16 = conv(bias = Conv_22_bias_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = Conv_22_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 4, 1, 1]> input_31_cast_fp16 = silu(x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_33_strides_0 = const()[name = tensor<string, []>("input_33_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_33_dilations_0 = const()[name = tensor<string, []>("input_33_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_33_groups_0 = const()[name = tensor<string, []>("input_33_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [96, 4, 1, 1]> Conv_25_weight_to_fp16 = const()[name = tensor<string, []>("Conv_25_weight_to_fp16"), val = tensor<fp16, [96, 4, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10368)))];
            tensor<fp16, [96]> Conv_25_bias_to_fp16 = const()[name = tensor<string, []>("Conv_25_bias_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11200)))];
            tensor<fp16, [1, 96, 1, 1]> input_33_cast_fp16 = conv(bias = Conv_25_bias_to_fp16, dilations = input_33_dilations_0, groups = input_33_groups_0, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = input_33_strides_0, weight = Conv_25_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [1, 96, 1, 1]> first_3_cast_fp16 = sigmoid(x = input_33_cast_fp16)[name = tensor<string, []>("first_3_cast_fp16")];
            tensor<fp16, [1, 96, 32, 24]> input_35_cast_fp16 = mul(x = first_3_cast_fp16, y = input_tensor_3_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_37_strides_0 = const()[name = tensor<string, []>("input_37_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_37_dilations_0 = const()[name = tensor<string, []>("input_37_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_37_groups_0 = const()[name = tensor<string, []>("input_37_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [24, 96, 1, 1]> Conv_28_weight_to_fp16 = const()[name = tensor<string, []>("Conv_28_weight_to_fp16"), val = tensor<fp16, [24, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11456)))];
            tensor<fp16, [24]> Conv_28_bias_to_fp16 = const()[name = tensor<string, []>("Conv_28_bias_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16128)))];
            tensor<fp16, [1, 24, 32, 24]> input_37_cast_fp16 = conv(bias = Conv_28_bias_to_fp16, dilations = input_37_dilations_0, groups = input_37_groups_0, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = input_37_strides_0, weight = Conv_28_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> input_39_pad_type_0 = const()[name = tensor<string, []>("input_39_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_39_strides_0 = const()[name = tensor<string, []>("input_39_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_39_pad_0 = const()[name = tensor<string, []>("input_39_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_39_dilations_0 = const()[name = tensor<string, []>("input_39_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_39_groups_0 = const()[name = tensor<string, []>("input_39_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [144, 24, 1, 1]> Conv_29_weight_to_fp16 = const()[name = tensor<string, []>("Conv_29_weight_to_fp16"), val = tensor<fp16, [144, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16256)))];
            tensor<fp16, [144]> Conv_29_bias_to_fp16 = const()[name = tensor<string, []>("Conv_29_bias_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23232)))];
            tensor<fp16, [1, 144, 32, 24]> input_39_cast_fp16 = conv(bias = Conv_29_bias_to_fp16, dilations = input_39_dilations_0, groups = input_39_groups_0, pad = input_39_pad_0, pad_type = input_39_pad_type_0, strides = input_39_strides_0, weight = Conv_29_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [1, 144, 32, 24]> input_41_cast_fp16 = silu(x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> input_43_pad_type_0 = const()[name = tensor<string, []>("input_43_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_43_pad_0 = const()[name = tensor<string, []>("input_43_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_43_groups_0 = const()[name = tensor<string, []>("input_43_groups_0"), val = tensor<int32, []>(144)];
            tensor<int32, [2]> input_43_strides_0 = const()[name = tensor<string, []>("input_43_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_43_dilations_0 = const()[name = tensor<string, []>("input_43_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [144, 1, 3, 3]> Conv_32_weight_to_fp16 = const()[name = tensor<string, []>("Conv_32_weight_to_fp16"), val = tensor<fp16, [144, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23616)))];
            tensor<fp16, [144]> Conv_32_bias_to_fp16 = const()[name = tensor<string, []>("Conv_32_bias_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26304)))];
            tensor<fp16, [1, 144, 32, 24]> input_43_cast_fp16 = conv(bias = Conv_32_bias_to_fp16, dilations = input_43_dilations_0, groups = input_43_groups_0, pad = input_43_pad_0, pad_type = input_43_pad_type_0, strides = input_43_strides_0, weight = Conv_32_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [1, 144, 32, 24]> input_tensor_5_cast_fp16 = silu(x = input_43_cast_fp16)[name = tensor<string, []>("input_tensor_5_cast_fp16")];
            tensor<int32, [2]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> input_45_keep_dims_0 = const()[name = tensor<string, []>("input_45_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 144, 1, 1]> input_45_cast_fp16 = reduce_mean(axes = input_45_axes_0, keep_dims = input_45_keep_dims_0, x = input_tensor_5_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<string, []> input_47_pad_type_0 = const()[name = tensor<string, []>("input_47_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_47_strides_0 = const()[name = tensor<string, []>("input_47_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_47_pad_0 = const()[name = tensor<string, []>("input_47_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_47_dilations_0 = const()[name = tensor<string, []>("input_47_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_47_groups_0 = const()[name = tensor<string, []>("input_47_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [6, 144, 1, 1]> Conv_36_weight_to_fp16 = const()[name = tensor<string, []>("Conv_36_weight_to_fp16"), val = tensor<fp16, [6, 144, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26688)))];
            tensor<fp16, [6]> Conv_36_bias_to_fp16 = const()[name = tensor<string, []>("Conv_36_bias_to_fp16"), val = tensor<fp16, [6]>([0x1.f14p-4, 0x1.604p-4, 0x1.e9p-4, 0x1.bc4p-3, 0x1.0dp-2, -0x1.028p-4])];
            tensor<fp16, [1, 6, 1, 1]> input_47_cast_fp16 = conv(bias = Conv_36_bias_to_fp16, dilations = input_47_dilations_0, groups = input_47_groups_0, pad = input_47_pad_0, pad_type = input_47_pad_type_0, strides = input_47_strides_0, weight = Conv_36_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [1, 6, 1, 1]> input_49_cast_fp16 = silu(x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<string, []> input_51_pad_type_0 = const()[name = tensor<string, []>("input_51_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_51_strides_0 = const()[name = tensor<string, []>("input_51_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_51_pad_0 = const()[name = tensor<string, []>("input_51_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_51_dilations_0 = const()[name = tensor<string, []>("input_51_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_51_groups_0 = const()[name = tensor<string, []>("input_51_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [144, 6, 1, 1]> Conv_39_weight_to_fp16 = const()[name = tensor<string, []>("Conv_39_weight_to_fp16"), val = tensor<fp16, [144, 6, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28480)))];
            tensor<fp16, [144]> Conv_39_bias_to_fp16 = const()[name = tensor<string, []>("Conv_39_bias_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30272)))];
            tensor<fp16, [1, 144, 1, 1]> input_51_cast_fp16 = conv(bias = Conv_39_bias_to_fp16, dilations = input_51_dilations_0, groups = input_51_groups_0, pad = input_51_pad_0, pad_type = input_51_pad_type_0, strides = input_51_strides_0, weight = Conv_39_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1, 144, 1, 1]> first_5_cast_fp16 = sigmoid(x = input_51_cast_fp16)[name = tensor<string, []>("first_5_cast_fp16")];
            tensor<fp16, [1, 144, 32, 24]> input_53_cast_fp16 = mul(x = first_5_cast_fp16, y = input_tensor_5_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<string, []> first_7_pad_type_0 = const()[name = tensor<string, []>("first_7_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_7_strides_0 = const()[name = tensor<string, []>("first_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_7_pad_0 = const()[name = tensor<string, []>("first_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_7_dilations_0 = const()[name = tensor<string, []>("first_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_7_groups_0 = const()[name = tensor<string, []>("first_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [24, 144, 1, 1]> Conv_42_weight_to_fp16 = const()[name = tensor<string, []>("Conv_42_weight_to_fp16"), val = tensor<fp16, [24, 144, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30656)))];
            tensor<fp16, [24]> Conv_42_bias_to_fp16 = const()[name = tensor<string, []>("Conv_42_bias_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37632)))];
            tensor<fp16, [1, 24, 32, 24]> first_7_cast_fp16 = conv(bias = Conv_42_bias_to_fp16, dilations = first_7_dilations_0, groups = first_7_groups_0, pad = first_7_pad_0, pad_type = first_7_pad_type_0, strides = first_7_strides_0, weight = Conv_42_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("first_7_cast_fp16")];
            tensor<fp16, [1, 24, 32, 24]> input_55_cast_fp16 = add(x = first_7_cast_fp16, y = input_37_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_57_strides_0 = const()[name = tensor<string, []>("input_57_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_57_dilations_0 = const()[name = tensor<string, []>("input_57_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_57_groups_0 = const()[name = tensor<string, []>("input_57_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [144, 24, 1, 1]> Conv_44_weight_to_fp16 = const()[name = tensor<string, []>("Conv_44_weight_to_fp16"), val = tensor<fp16, [144, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37760)))];
            tensor<fp16, [144]> Conv_44_bias_to_fp16 = const()[name = tensor<string, []>("Conv_44_bias_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44736)))];
            tensor<fp16, [1, 144, 32, 24]> input_57_cast_fp16 = conv(bias = Conv_44_bias_to_fp16, dilations = input_57_dilations_0, groups = input_57_groups_0, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = input_57_strides_0, weight = Conv_44_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, [1, 144, 32, 24]> input_59_cast_fp16 = silu(x = input_57_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([2, 2, 2, 2])];
            tensor<int32, [2]> input_61_strides_0 = const()[name = tensor<string, []>("input_61_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_61_groups_0 = const()[name = tensor<string, []>("input_61_groups_0"), val = tensor<int32, []>(144)];
            tensor<int32, [2]> input_61_dilations_0 = const()[name = tensor<string, []>("input_61_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [144, 1, 5, 5]> Conv_47_weight_to_fp16 = const()[name = tensor<string, []>("Conv_47_weight_to_fp16"), val = tensor<fp16, [144, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45120)))];
            tensor<fp16, [144]> Conv_47_bias_to_fp16 = const()[name = tensor<string, []>("Conv_47_bias_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52416)))];
            tensor<fp16, [1, 144, 16, 12]> input_61_cast_fp16 = conv(bias = Conv_47_bias_to_fp16, dilations = input_61_dilations_0, groups = input_61_groups_0, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = input_61_strides_0, weight = Conv_47_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, [1, 144, 16, 12]> input_tensor_7_cast_fp16 = silu(x = input_61_cast_fp16)[name = tensor<string, []>("input_tensor_7_cast_fp16")];
            tensor<int32, [2]> input_63_axes_0 = const()[name = tensor<string, []>("input_63_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> input_63_keep_dims_0 = const()[name = tensor<string, []>("input_63_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 144, 1, 1]> input_63_cast_fp16 = reduce_mean(axes = input_63_axes_0, keep_dims = input_63_keep_dims_0, x = input_tensor_7_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_65_strides_0 = const()[name = tensor<string, []>("input_65_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_65_dilations_0 = const()[name = tensor<string, []>("input_65_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_65_groups_0 = const()[name = tensor<string, []>("input_65_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [6, 144, 1, 1]> Conv_51_weight_to_fp16 = const()[name = tensor<string, []>("Conv_51_weight_to_fp16"), val = tensor<fp16, [6, 144, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(52800)))];
            tensor<fp16, [6]> Conv_51_bias_to_fp16 = const()[name = tensor<string, []>("Conv_51_bias_to_fp16"), val = tensor<fp16, [6]>([0x1.238p-3, 0x1.a44p-4, 0x1.de4p-5, 0x1.e08p-2, 0x1.908p-4, -0x1.eecp-5])];
            tensor<fp16, [1, 6, 1, 1]> input_65_cast_fp16 = conv(bias = Conv_51_bias_to_fp16, dilations = input_65_dilations_0, groups = input_65_groups_0, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = input_65_strides_0, weight = Conv_51_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [1, 6, 1, 1]> input_67_cast_fp16 = silu(x = input_65_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_69_strides_0 = const()[name = tensor<string, []>("input_69_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_69_dilations_0 = const()[name = tensor<string, []>("input_69_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_69_groups_0 = const()[name = tensor<string, []>("input_69_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [144, 6, 1, 1]> Conv_54_weight_to_fp16 = const()[name = tensor<string, []>("Conv_54_weight_to_fp16"), val = tensor<fp16, [144, 6, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(54592)))];
            tensor<fp16, [144]> Conv_54_bias_to_fp16 = const()[name = tensor<string, []>("Conv_54_bias_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56384)))];
            tensor<fp16, [1, 144, 1, 1]> input_69_cast_fp16 = conv(bias = Conv_54_bias_to_fp16, dilations = input_69_dilations_0, groups = input_69_groups_0, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = input_69_strides_0, weight = Conv_54_weight_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, [1, 144, 1, 1]> first_9_cast_fp16 = sigmoid(x = input_69_cast_fp16)[name = tensor<string, []>("first_9_cast_fp16")];
            tensor<fp16, [1, 144, 16, 12]> input_71_cast_fp16 = mul(x = first_9_cast_fp16, y = input_tensor_7_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_73_strides_0 = const()[name = tensor<string, []>("input_73_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_73_dilations_0 = const()[name = tensor<string, []>("input_73_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_73_groups_0 = const()[name = tensor<string, []>("input_73_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [40, 144, 1, 1]> Conv_57_weight_to_fp16 = const()[name = tensor<string, []>("Conv_57_weight_to_fp16"), val = tensor<fp16, [40, 144, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56768)))];
            tensor<fp16, [40]> Conv_57_bias_to_fp16 = const()[name = tensor<string, []>("Conv_57_bias_to_fp16"), val = tensor<fp16, [40]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68352)))];
            tensor<fp16, [1, 40, 16, 12]> input_73_cast_fp16 = conv(bias = Conv_57_bias_to_fp16, dilations = input_73_dilations_0, groups = input_73_groups_0, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = input_73_strides_0, weight = Conv_57_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<string, []> input_75_pad_type_0 = const()[name = tensor<string, []>("input_75_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_75_strides_0 = const()[name = tensor<string, []>("input_75_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_75_pad_0 = const()[name = tensor<string, []>("input_75_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_75_dilations_0 = const()[name = tensor<string, []>("input_75_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_75_groups_0 = const()[name = tensor<string, []>("input_75_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [240, 40, 1, 1]> Conv_58_weight_to_fp16 = const()[name = tensor<string, []>("Conv_58_weight_to_fp16"), val = tensor<fp16, [240, 40, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68544)))];
            tensor<fp16, [240]> Conv_58_bias_to_fp16 = const()[name = tensor<string, []>("Conv_58_bias_to_fp16"), val = tensor<fp16, [240]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(87808)))];
            tensor<fp16, [1, 240, 16, 12]> input_75_cast_fp16 = conv(bias = Conv_58_bias_to_fp16, dilations = input_75_dilations_0, groups = input_75_groups_0, pad = input_75_pad_0, pad_type = input_75_pad_type_0, strides = input_75_strides_0, weight = Conv_58_weight_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [1, 240, 16, 12]> input_77_cast_fp16 = silu(x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<string, []> input_79_pad_type_0 = const()[name = tensor<string, []>("input_79_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_79_pad_0 = const()[name = tensor<string, []>("input_79_pad_0"), val = tensor<int32, [4]>([2, 2, 2, 2])];
            tensor<int32, []> input_79_groups_0 = const()[name = tensor<string, []>("input_79_groups_0"), val = tensor<int32, []>(240)];
            tensor<int32, [2]> input_79_strides_0 = const()[name = tensor<string, []>("input_79_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_79_dilations_0 = const()[name = tensor<string, []>("input_79_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [240, 1, 5, 5]> Conv_61_weight_to_fp16 = const()[name = tensor<string, []>("Conv_61_weight_to_fp16"), val = tensor<fp16, [240, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(88384)))];
            tensor<fp16, [240]> Conv_61_bias_to_fp16 = const()[name = tensor<string, []>("Conv_61_bias_to_fp16"), val = tensor<fp16, [240]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(100480)))];
            tensor<fp16, [1, 240, 16, 12]> input_79_cast_fp16 = conv(bias = Conv_61_bias_to_fp16, dilations = input_79_dilations_0, groups = input_79_groups_0, pad = input_79_pad_0, pad_type = input_79_pad_type_0, strides = input_79_strides_0, weight = Conv_61_weight_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<fp16, [1, 240, 16, 12]> input_tensor_9_cast_fp16 = silu(x = input_79_cast_fp16)[name = tensor<string, []>("input_tensor_9_cast_fp16")];
            tensor<int32, [2]> input_81_axes_0 = const()[name = tensor<string, []>("input_81_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> input_81_keep_dims_0 = const()[name = tensor<string, []>("input_81_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 240, 1, 1]> input_81_cast_fp16 = reduce_mean(axes = input_81_axes_0, keep_dims = input_81_keep_dims_0, x = input_tensor_9_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<string, []> input_83_pad_type_0 = const()[name = tensor<string, []>("input_83_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_83_strides_0 = const()[name = tensor<string, []>("input_83_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_83_pad_0 = const()[name = tensor<string, []>("input_83_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_83_dilations_0 = const()[name = tensor<string, []>("input_83_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_83_groups_0 = const()[name = tensor<string, []>("input_83_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [10, 240, 1, 1]> Conv_65_weight_to_fp16 = const()[name = tensor<string, []>("Conv_65_weight_to_fp16"), val = tensor<fp16, [10, 240, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101056)))];
            tensor<fp16, [10]> Conv_65_bias_to_fp16 = const()[name = tensor<string, []>("Conv_65_bias_to_fp16"), val = tensor<fp16, [10]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(105920)))];
            tensor<fp16, [1, 10, 1, 1]> input_83_cast_fp16 = conv(bias = Conv_65_bias_to_fp16, dilations = input_83_dilations_0, groups = input_83_groups_0, pad = input_83_pad_0, pad_type = input_83_pad_type_0, strides = input_83_strides_0, weight = Conv_65_weight_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<fp16, [1, 10, 1, 1]> input_85_cast_fp16 = silu(x = input_83_cast_fp16)[name = tensor<string, []>("input_85_cast_fp16")];
            tensor<string, []> input_87_pad_type_0 = const()[name = tensor<string, []>("input_87_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_87_strides_0 = const()[name = tensor<string, []>("input_87_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_87_pad_0 = const()[name = tensor<string, []>("input_87_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_87_dilations_0 = const()[name = tensor<string, []>("input_87_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_87_groups_0 = const()[name = tensor<string, []>("input_87_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [240, 10, 1, 1]> Conv_68_weight_to_fp16 = const()[name = tensor<string, []>("Conv_68_weight_to_fp16"), val = tensor<fp16, [240, 10, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106048)))];
            tensor<fp16, [240]> Conv_68_bias_to_fp16 = const()[name = tensor<string, []>("Conv_68_bias_to_fp16"), val = tensor<fp16, [240]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110912)))];
            tensor<fp16, [1, 240, 1, 1]> input_87_cast_fp16 = conv(bias = Conv_68_bias_to_fp16, dilations = input_87_dilations_0, groups = input_87_groups_0, pad = input_87_pad_0, pad_type = input_87_pad_type_0, strides = input_87_strides_0, weight = Conv_68_weight_to_fp16, x = input_85_cast_fp16)[name = tensor<string, []>("input_87_cast_fp16")];
            tensor<fp16, [1, 240, 1, 1]> first_11_cast_fp16 = sigmoid(x = input_87_cast_fp16)[name = tensor<string, []>("first_11_cast_fp16")];
            tensor<fp16, [1, 240, 16, 12]> input_89_cast_fp16 = mul(x = first_11_cast_fp16, y = input_tensor_9_cast_fp16)[name = tensor<string, []>("input_89_cast_fp16")];
            tensor<string, []> first_13_pad_type_0 = const()[name = tensor<string, []>("first_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_13_strides_0 = const()[name = tensor<string, []>("first_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_13_pad_0 = const()[name = tensor<string, []>("first_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_13_dilations_0 = const()[name = tensor<string, []>("first_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_13_groups_0 = const()[name = tensor<string, []>("first_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [40, 240, 1, 1]> Conv_71_weight_to_fp16 = const()[name = tensor<string, []>("Conv_71_weight_to_fp16"), val = tensor<fp16, [40, 240, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(111488)))];
            tensor<fp16, [40]> Conv_71_bias_to_fp16 = const()[name = tensor<string, []>("Conv_71_bias_to_fp16"), val = tensor<fp16, [40]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(130752)))];
            tensor<fp16, [1, 40, 16, 12]> first_13_cast_fp16 = conv(bias = Conv_71_bias_to_fp16, dilations = first_13_dilations_0, groups = first_13_groups_0, pad = first_13_pad_0, pad_type = first_13_pad_type_0, strides = first_13_strides_0, weight = Conv_71_weight_to_fp16, x = input_89_cast_fp16)[name = tensor<string, []>("first_13_cast_fp16")];
            tensor<fp16, [1, 40, 16, 12]> input_91_cast_fp16 = add(x = first_13_cast_fp16, y = input_73_cast_fp16)[name = tensor<string, []>("input_91_cast_fp16")];
            tensor<string, []> input_93_pad_type_0 = const()[name = tensor<string, []>("input_93_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_93_strides_0 = const()[name = tensor<string, []>("input_93_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_93_pad_0 = const()[name = tensor<string, []>("input_93_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_93_dilations_0 = const()[name = tensor<string, []>("input_93_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_93_groups_0 = const()[name = tensor<string, []>("input_93_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [240, 40, 1, 1]> Conv_73_weight_to_fp16 = const()[name = tensor<string, []>("Conv_73_weight_to_fp16"), val = tensor<fp16, [240, 40, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(130944)))];
            tensor<fp16, [240]> Conv_73_bias_to_fp16 = const()[name = tensor<string, []>("Conv_73_bias_to_fp16"), val = tensor<fp16, [240]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(150208)))];
            tensor<fp16, [1, 240, 16, 12]> input_93_cast_fp16 = conv(bias = Conv_73_bias_to_fp16, dilations = input_93_dilations_0, groups = input_93_groups_0, pad = input_93_pad_0, pad_type = input_93_pad_type_0, strides = input_93_strides_0, weight = Conv_73_weight_to_fp16, x = input_91_cast_fp16)[name = tensor<string, []>("input_93_cast_fp16")];
            tensor<fp16, [1, 240, 16, 12]> input_95_cast_fp16 = silu(x = input_93_cast_fp16)[name = tensor<string, []>("input_95_cast_fp16")];
            tensor<string, []> input_97_pad_type_0 = const()[name = tensor<string, []>("input_97_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_97_pad_0 = const()[name = tensor<string, []>("input_97_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_97_strides_0 = const()[name = tensor<string, []>("input_97_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_97_groups_0 = const()[name = tensor<string, []>("input_97_groups_0"), val = tensor<int32, []>(240)];
            tensor<int32, [2]> input_97_dilations_0 = const()[name = tensor<string, []>("input_97_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [240, 1, 3, 3]> Conv_76_weight_to_fp16 = const()[name = tensor<string, []>("Conv_76_weight_to_fp16"), val = tensor<fp16, [240, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(150784)))];
            tensor<fp16, [240]> Conv_76_bias_to_fp16 = const()[name = tensor<string, []>("Conv_76_bias_to_fp16"), val = tensor<fp16, [240]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155200)))];
            tensor<fp16, [1, 240, 8, 6]> input_97_cast_fp16 = conv(bias = Conv_76_bias_to_fp16, dilations = input_97_dilations_0, groups = input_97_groups_0, pad = input_97_pad_0, pad_type = input_97_pad_type_0, strides = input_97_strides_0, weight = Conv_76_weight_to_fp16, x = input_95_cast_fp16)[name = tensor<string, []>("input_97_cast_fp16")];
